# Data Input and Output

In [1]:
import numpy as np
import pandas as pd

## CSV

### CSV Input

In [2]:
df = pd.read_csv('../../WorkingD/empdata.csv')
df

,Employee_ID,FirstName,LastName,Education,Occupation,YearlyIncome,Sales
0,1,John,Yang,Bachelors,Professional,90000,3578.2700
1,2,Rob,Johnson,Bachelors,Management,80000,3399.9900
2,3,Ruben,Torres,Partial College,Skilled Manual,50000,699.0982
3,4,Christy,Zhu,Bachelors,Professional,80000,3078.2700
4,5,Rob,Huang,High School,Skilled Manual,60000,2319.9900
5,6,John,Ruiz,Bachelors,Professional,70000,539.9900
6,7,John,Miller,Masters Degree,Management,80000,2320.4900
7,8,Christy,Mehta,Partial High School,Clerical,50000,24.9900
8,9,Rob,Verhoff,Partial High School,Clerical,45000,24.9900
9,10,Christy,Carlson,Graduate Degree,Management,70000,2234.9900
10,11,Gail,Erickson,Education,Professional,90000,4319.9900
11,12,Barry,Johnson,Education,Management,80000,4968.5900
12,13,Peter,Krebs,Graduate Degree,Clerical,50000,59.5300
13,14,Greg,Alderson,Partial High School,Clerical,45000,23.5000

In [3]:
pd.read_csv("atin.txt", sep=" ")

FileNotFoundError: [Errno 2] File b'atin.txt' does not exist: b'atin.txt'

### CSV Output

In [ ]:
df.to_csv('example.csv',index=False)

In [19]:
!pip install xlrd --user

WARNING: pip is being invoked by an old script wrapper. This will fail in a future version of pip.
Please see https://github.com/pypa/pip/issues/5599 for advice on fixing the underlying issue.
To avoid this problem you can invoke Python with '-m pip' instead of running pip directly.
Requirement already satisfied: xlrd in /home/u1/.local/lib/python3.7/site-packages (1.2.0)

## Excel
Pandas can read and write excel files, keep in mind, this only imports data. Not formulas or images, having images or macros may cause this read_excel method to crash.

### Excel Input

In [24]:
pd.read_excel('../../WorkingD/EmployeeSales.xlsx',sheet_name='Sheet1')

,FirstName,LastName,Education,Occupation,YearlyIncome,Sales
0,John,Yang,Bachelors,Professional,90000,3578.2700
1,Rob,Johnson,Bachelors,Management,80000,3399.9900
2,Ruben,Torres,Partial College,Skilled Manual,50000,699.0982
3,Christy,Zhu,Bachelors,Professional,80000,3078.2700
4,Rob,Huang,High School,Skilled Manual,60000,2319.9900
5,John,Ruiz,Bachelors,Professional,70000,539.9900
6,John,Miller,Masters Degree,Management,80000,2320.4900
7,Christy,Mehta,Partial High School,Clerical,50000,24.9900
8,Rob,Verhoff,Partial High School,Clerical,45000,24.9900
9,Christy,Carlson,Graduate Degree,Management,70000,2234.9900
10,Gail,Erickson,Education,Professional,90000,4319.9900
11,Barry,Johnson,Education,Management,80000,4968.5900
12,Peter,Krebs,Graduate Degree,Clerical,50000,59.5300
13,Greg,Alderson,Partial High School,Clerical,45000,23.5000

### Excel Output

In [0]:
df.to_excel('Excel_Sample.xlsx',sheet_name='Sheet1')

## HTML

You may need to install htmllib5,lxml, and BeautifulSoup4. In your terminal/command prompt run:

    conda install lxml
    conda install html5lib
    conda install BeautifulSoup4

Then restart Jupyter Notebook.
(or use pip install if you aren't using the Anaconda Distribution)

Pandas can read table tabs off of html. For example:

In [31]:
!pip install lxml
!pip install html5lib
!pip install BeautifulSoup4

WARNING: pip is being invoked by an old script wrapper. This will fail in a future version of pip.
Please see https://github.com/pypa/pip/issues/5599 for advice on fixing the underlying issue.
To avoid this problem you can invoke Python with '-m pip' instead of running pip directly.
Defaulting to user installation because normal site-packages is not writeable
Requirement already satisfied: lxml in /usr/local/lib/python3.7/dist-packages (4.4.2)
WARNING: pip is being invoked by an old script wrapper. This will fail in a future version of pip.
Please see https://github.com/pypa/pip/issues/5599 for advice on fixing the underlying issue.
To avoid this problem you can invoke Python with '-m pip' instead of running pip directly.
Defaulting to user installation because normal site-packages is not writeable
Requirement already satisfied: html5lib in /home/u1/.local/lib/python3.7/site-packages (1.1)
Requirement already satisfied: webencodings in /usr/local/lib/python3.7/dist-packages (from html5lib) (0.5.1)
Requirement already satisfied: six>=1.9 in /usr/local/lib/python3.7/dist-packages (from html5lib) (1.14.0)
WARNING: pip is being invoked by an old script wrapper. This will fail in a future version of pip.
Please see https://github.com/pypa/pip/issues/5599 for advice on fixing the underlying issue.
To avoid this problem you can invoke Python with '-m pip' instead of running pip directly.
Defaulting to user installation because normal site-packages is not writeable
Requirement already satisfied: BeautifulSoup4 in /home/u1/.local/lib/python3.7/site-packages (4.9.3)
Requirement already satisfied: soupsieve>1.2 in /home/u1/.local/lib/python3.7/site-packages (from BeautifulSoup4) (2.2.1)

### HTML Input

Pandas read_html function will read tables off of a webpage and return a list of DataFrame objects:

In [2]:
df = pd.read_html('https://developer.mozilla.org/en-US/docs/Learn/HTML/Tables/Basics')

In [9]:
df[1]

,Unnamed: 0,Unnamed: 1,Name,Mass (1024kg),Diameter (km),Density (kg/m3),Gravity (m/s2),Length of day (hours),Distance from Sun (106km),Mean temperature (°C),Number of moons,Notes
0,Terrestial planets,Terrestial planets,Mercury,0.3300,4879,5427,3.7,4222.6,57.9,167,0,Closest to the Sun
1,Terrestial planets,Terrestial planets,Venus,4.8700,12104,5243,8.9,2802.0,108.2,464,0,NaN
2,Terrestial planets,Terrestial planets,Earth,5.9700,12756,5514,9.8,24.0,149.6,15,1,Our world
3,Terrestial planets,Terrestial planets,Mars,0.6420,6792,3933,3.7,24.7,227.9,-65,2,The red planet
4,Jovian planets,Gas giants,Jupiter,1898.0000,142984,1326,23.1,9.9,778.6,-110,67,The largest planet
5,Jovian planets,Gas giants,Saturn,568.0000,120536,687,9.0,10.7,1433.5,-140,62,NaN
6,Jovian planets,Ice giants,Uranus,86.8000,51118,1271,8.7,17.2,2872.5,-195,27,NaN
7,Jovian planets,Ice giants,Neptune,102.0000,49528,1638,11.0,16.1,4495.1,-200,14,NaN
8,Dwarf planets,Dwarf planets,Pluto,0.0146,2370,2095,0.7,153.3,5906.4,-225,5,"Declassified as a planet in 2006, but this rem..."

____

_____
_____
# SQL (Optional)

* Note: If you are completely unfamiliar with SQL you can check out my other course: "Complete SQL Bootcamp" to learn SQL.

The pandas.io.sql module provides a collection of query wrappers to both facilitate data retrieval and to reduce dependency on DB-specific API. Database abstraction is provided by SQLAlchemy if installed. In addition you will need a driver library for your database. Examples of such drivers are psycopg2 for PostgreSQL or pymysql for MySQL. For SQLite this is included in Python’s standard library by default. You can find an overview of supported drivers for each SQL dialect in the SQLAlchemy docs.


If SQLAlchemy is not installed, a fallback is only provided for sqlite (and for mysql for backwards compatibility, but this is deprecated and will be removed in a future version). This mode requires a Python database adapter which respect the Python DB-API.

See also some cookbook examples for some advanced strategies.

The key functions are:

* read_sql_table(table_name, con[, schema, ...])	
    * Read SQL database table into a DataFrame.
* read_sql_query(sql, con[, index_col, ...])	
    * Read SQL query into a DataFrame.
* read_sql(sql, con[, index_col, ...])	
    * Read SQL query or database table into a DataFrame.
* DataFrame.to_sql(name, con[, flavor, ...])	
    * Write records stored in a DataFrame to a SQL database.

In [10]:
from sqlalchemy import create_engine

In [11]:
engine = create_engine('sqlite:///:memory:')

In [12]:
connection = engine.connect()

In [13]:
connection.execute(
    """
    CREATE TABLE users (
        username VARCHAR PRIMARY KEY,
        password VARCHAR NOT NULL
    );
    """
)

In [14]:
connection.execute(
    """
    INSERT INTO users (username, password) VALUES (?, ?);
    """,
    "foo", "bar"
)

In [17]:
result = connection.execute("SELECT username FROM users")
for row in result:
    print ("username:", row['username'])

username: foo

In [15]:
df[1].to_sql('data', engine)

In [17]:
result = connection.execute("SELECT * FROM data where Name = 'Venus'")
for row in result:
    print (row)

(1, 'Terrestial planets', 'Terrestial planets', 'Venus', 4.87, 12104, 5243, 8.9, 2802.0, 108.2, 464, 0, None)

In [18]:
sql_df = pd.read_sql('data',con=engine)

In [19]:
sql_df

,index,Unnamed: 0,Unnamed: 1,Name,Mass (1024kg),Diameter (km),Density (kg/m3),Gravity (m/s2),Length of day (hours),Distance from Sun (106km),Mean temperature (°C),Number of moons,Notes
0,0,Terrestial planets,Terrestial planets,Mercury,0.3300,4879,5427,3.7,4222.6,57.9,167,0,Closest to the Sun
1,1,Terrestial planets,Terrestial planets,Venus,4.8700,12104,5243,8.9,2802.0,108.2,464,0,None
2,2,Terrestial planets,Terrestial planets,Earth,5.9700,12756,5514,9.8,24.0,149.6,15,1,Our world
3,3,Terrestial planets,Terrestial planets,Mars,0.6420,6792,3933,3.7,24.7,227.9,-65,2,The red planet
4,4,Jovian planets,Gas giants,Jupiter,1898.0000,142984,1326,23.1,9.9,778.6,-110,67,The largest planet
5,5,Jovian planets,Gas giants,Saturn,568.0000,120536,687,9.0,10.7,1433.5,-140,62,None
6,6,Jovian planets,Ice giants,Uranus,86.8000,51118,1271,8.7,17.2,2872.5,-195,27,None
7,7,Jovian planets,Ice giants,Neptune,102.0000,49528,1638,11.0,16.1,4495.1,-200,14,None
8,8,Dwarf planets,Dwarf planets,Pluto,0.0146,2370,2095,0.7,153.3,5906.4,-225,5,"Declassified as a planet in 2006, but this rem..."

# Great Job!